# 데이터 전처리
- 행 혹은 열(변수)에 대한 재배치, 이름 변경
- 정렬
- 특정 데이터 필터링
- 행 혹은 열 추가, 삭제
- inplace = True로 원본을 바꿀 수 있다(원본 반영보다는 복사본 생성, 사용)
- 파생변수 즉, 데이터 추가

## #01.

### 1. 패키지 참조

In [1]:
from pandas import read_excel
from pandas import Series
import numpy

### 2. 데이터 가져오기

In [2]:
# 자료를 확인 후 index를 지정
df = read_excel("https://data.hossam.kr/pre_sample.xlsx", index_col="이름")
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

### 3. 데이터 확인하기

#### 데이터 크기

In [3]:
df.shape

(9, 6)

#### 각 변수(column)의 데이터 타입 확인

In [4]:
# 숫자에 결측치가 있다면 float type으로 출력
df.dtypes

학년     int64
성별    object
국어     int64
영어     int64
수학     int64
과학     int64
dtype: object

#### 데이터 타입 변경
- 결과가 적용된 복사본이 리턴
- 복사본이 있다면 원본은 영향을 받지 않는다

In [5]:
# dict 형태로 변수 즉 열의 데이터 타입 변경 가능
df2 = df.astype({'국어':'float', '영어' : 'float', '수학' : 'str', '과학' : 'bool'})
df2

    학년  성별    국어     영어  수학    과학
이름
철수   1  남자  98.0   77.0  88  True
영희   2  여자  88.0  120.0  62  True
민철   1  남자  92.0   70.0  83  True
수현   3  여자  63.0   60.0  31  True
호영   4  남자  75.0   50.0  90  True
영호   4  남자  80.0   88.0  91  True
용식   2  남자  82.0   88.0  79  True
나영   1  여자  90.0   92.0  81  True
석영   1  남자  91.0   90.0  89  True

In [6]:
# 각 변수(column)의 데이터 타입 확인(원본과 비교)
print(df.dtypes)
print("-"*30)
print(df2.dtypes)

학년     int64
성별    object
국어     int64
영어     int64
수학     int64
과학     int64
dtype: object
------------------------------
학년      int64
성별     object
국어    float64
영어    float64
수학     object
과학       bool
dtype: object

## #02. 행 혹은 열(변수)에 대한 재배치, 이름 변경

### 1. 열 순서 변경
- 지정된 순서대로 열이 재정렬된 결과가 반환
- 결과가 적용된 복사본이 생성되서 원본은 변화 없음
- 재배치 되지 못한 열은 제외
- 원본에 없는 열을 추출하려고 할 경우 NaN으로 반환

In [7]:
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [8]:
df1 = df.reindex(columns=['국어', '수학', '과학', '영어'])
df1

    국어  수학  과학   영어
이름
철수  98  88  64   77
영희  88  62  72  120
민철  92  83  79   70
수현  63  31  71   60
호영  75  90  88   50
영호  80  91  72   88
용식  82  79  90   88
나영  90  81  95   92
석영  91  89  80   90

In [9]:
# df1x = df.reindex(columns=['국어', '수학', '과학', '일어'])
# df1x

### 2. 행 순서 변경
- 지정된 순수대로 행이 재정렬된 결과가 반환
- 결과가 적용된 복사본이 생성, 원본 유지
- 재배치 되지 못한 행은 제외
- 원본에 없는 행을 추출하려고 할 경우 NaN으로 반환

In [10]:
df2 = df.reindex(index=['석영', '호영', '민철', '수현'])
df2

    학년  성별  국어  영어  수학  과학
이름
석영   1  남자  91  90  89  80
호영   4  남자  75  50  90  88
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  71

In [11]:
# df2x = df.reindex(index=['저희', '호영', '민철', '수현'])
# df2x

### 3. 행, 열의 이름 변경
- 기존이름: 새이름 형식의 딕셔너리로 지정
- columns와 index중 변경을 원하는 하나만 설정 가능
- 결과가 적용된 복사본이 생성, 원본 유지
- 이름이 변경되지 않은 항목이 결과에서 제외되지는 않는다\
즉, 결과에 포함됨
- 원본에 즉시 반영해야 할 경우 
inplace=True 파라미터 사용

In [12]:
df3 = df.rename(
    columns={'국어':'kor', '영어':'eng', '수학':'math', '과학':'sci'},
    index={'석영':'suk', '호영':'ho', '민철':'min', '수현':'su'}
)
df3

     학년  성별  kor  eng  math  sci
이름
철수    1  남자   98   77    88   64
영희    2  여자   88  120    62   72
min   1  남자   92   70    83   79
su    3  여자   63   60    31   71
ho    4  남자   75   50    90   88
영호    4  남자   80   88    91   72
용식    2  남자   82   88    79   90
나영    1  여자   90   92    81   95
suk   1  남자   91   90    89   80

## #03. 정렬
특정 변수(열-컬럼) 기준으로 행 단위로 정렬

### 1. 변수에 대한 오름차수(ASC)

단일 컬럼에 대한 정렬
- 원본에 즉시 반영해야 할 경우 inplace=True 파라미터를 적용

In [13]:
# 국어의 열을 오름차순 정렬
df4 = df.sort_values('국어')
df4

    학년  성별  국어   영어  수학  과학
이름
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
영희   2  여자  88  120  62  72
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
민철   1  남자  92   70  83  79
철수   1  남자  98   77  88  64

복수 컬럼에 대한 정렬
- 정렬 기준이 되는 컬럼 이름을 리스트로 설정했을 때\
첫 번째 컬럼의 값이 동일한 경우 두 번째 컬럼을 기준으로 정렬

In [14]:
df5 = df.sort_values(['국어', '학년'])
df5

    학년  성별  국어   영어  수학  과학
이름
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
영희   2  여자  88  120  62  72
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
민철   1  남자  92   70  83  79
철수   1  남자  98   77  88  64

### 2. 변수에 대한 내림차순
- ascending=False 파라미터를 추가한다.(기본값=True,오름차순)

In [15]:
# 국어 컬럼의 값을 내림차순
df6 = df.sort_values('국어', ascending=False)
df6

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
민철   1  남자  92   70  83  79
석영   1  남자  91   90  89  80
나영   1  여자  90   92  81  95
영희   2  여자  88  120  62  72
용식   2  남자  82   88  79  90
영호   4  남자  80   88  91  72
호영   4  남자  75   50  90  88
수현   3  여자  63   60  31  71

### 3. 인덱스를 기준으로 하는 정렬
- 인덱스는 하나만 존재하므로 열 이름을 지정할 필요가 없다
- 정렬 방향을 위한 ascending 파라미터를\
False로 설정하면 내림차순으로 정렬
- inplace=True를 적용할 경우 원본에 즉시 반영

In [16]:
# index를 오름차순
df7 = df.sort_index()
df7

    학년  성별  국어   영어  수학  과학
이름
나영   1  여자  90   92  81  95
민철   1  남자  92   70  83  79
석영   1  남자  91   90  89  80
수현   3  여자  63   60  31  71
영호   4  남자  80   88  91  72
영희   2  여자  88  120  62  72
용식   2  남자  82   88  79  90
철수   1  남자  98   77  88  64
호영   4  남자  75   50  90  88

## #04. 특정 데이터 필터링

### 1. 행 단위 필터링 (조건검색 - query)
- 특정 조건에 맞는 행 조회

In [17]:
r1 = df.query('국어 > 80')
r1

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [18]:
# # 없는 행을 고르면 에러 발생
# r1x = df.query('구거 > 80')
# r1x

- AND 조건(& 사용가능)

In [19]:
r2 = df.query('국어 > 80 and 수학 >80')
r2

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
민철   1  남자  92  70  83  79
나영   1  여자  90  92  81  95
석영   1  남자  91  90  89  80

- OR 조건(| 사용 가능)

In [20]:
r3 = df.query('국어 > 80 or 수학 > 80')
r3

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

- 조건값을 변수로 적용

In [21]:
point = int(input('점수를 입력 : '))
print("입력한 점수인 %d점 보다 높은 학생은 다음과 같다" %point)

# @point 대신 %d %point도 가능
r4 = df.query('국어 > @point')
r4

입력한 점수인 90점 보다 높은 학생은 다음과 같다

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
민철   1  남자  92  70  83  79
석영   1  남자  91  90  89  80

### 2. 열 단위 필터링 (filter)

In [22]:
f1 = df.filter(['국어', '영어'])
f1

    국어   영어
이름
철수  98   77
영희  88  120
민철  92   70
수현  63   60
호영  75   50
영호  80   88
용식  82   88
나영  90   92
석영  91   90

## #05 행 혹은 열 추가, 삭제

### 1. 행 추가
> 원본 자체가 수정

리스트로 추가하기
- 추가될 행의 인덱스 이름을 지정
- 리스트로 추가할 경우 dataframe의 컬럼 순서에 맞게 지정
- 누락되는 값이 있거나 값의 수가 초과할 경우 에러

In [23]:
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [24]:
df.loc['정호'] = [2, '남자', 90, 80, 70, 60]
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
정호   2  남자  90   80  70  60

딕셔너리로 추가
- 컬럼 순서는 상관 없음
- 누락되는 값이 있거나 값의 수가 초과할 경우 에러

In [25]:
df.loc['민정'] = {'성별':'여자', '학년':4, '국어':81, '영어':72, '수학':84, '과학':90}
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
정호   2  남자  90   80  70  60
민정   4  여자  81   72  84  90

시리즈 객체로 추가
- 시리즈 객체의 index가 지정되지 않은 경우 값을 추가 할 수 없음

In [26]:
s = Series([2, '남자', 90, 80, 70, 60], index=['학년', '성별', '국어', '영어', '수학', '과학'])
df.loc['형석'] = s
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
정호   2  남자  90   80  70  60
민정   4  여자  81   72  84  90
형석   2  남자  90   80  70  60

빈값이 있는 경우
- Series 객체 형태만 가능
- 데이터가 부족해 빈 값이거나 초과할 경우\
NaN을 사용하기 위해서 Series를 사용

In [27]:
# 영어 누락
s = Series([2, '남자', 93, 71, 68], index=['학년', '성별', '국어', '수학', '과학'])
df.loc['석호'] = s
df

    학년  성별  국어     영어  수학  과학
이름
철수   1  남자  98   77.0  88  64
영희   2  여자  88  120.0  62  72
민철   1  남자  92   70.0  83  79
수현   3  여자  63   60.0  31  71
호영   4  남자  75   50.0  90  88
영호   4  남자  80   88.0  91  72
용식   2  남자  82   88.0  79  90
나영   1  여자  90   92.0  81  95
석영   1  남자  91   90.0  89  80
정호   2  남자  90   80.0  70  60
민정   4  여자  81   72.0  84  90
형석   2  남자  90   80.0  70  60
석호   2  남자  93    NaN  71  68

기존의 행 복사하기

In [28]:
df.loc['철민'] = df.loc['철수']
df

    학년  성별  국어     영어  수학  과학
이름
철수   1  남자  98   77.0  88  64
영희   2  여자  88  120.0  62  72
민철   1  남자  92   70.0  83  79
수현   3  여자  63   60.0  31  71
호영   4  남자  75   50.0  90  88
영호   4  남자  80   88.0  91  72
용식   2  남자  82   88.0  79  90
나영   1  여자  90   92.0  81  95
석영   1  남자  91   90.0  89  80
정호   2  남자  90   80.0  70  60
민정   4  여자  81   72.0  84  90
형석   2  남자  90   80.0  70  60
석호   2  남자  93    NaN  71  68
철민   1  남자  98   77.0  88  64

### 2. 행 삭제

단일 행 삭제
- 추가는 원본 자체가 변화하지만, 삭제는 결과가\
반영된 새로운 복사본이 생성
- drop() 메서드도 inplace=True 파라미터 적용 가능

In [29]:
df

    학년  성별  국어     영어  수학  과학
이름
철수   1  남자  98   77.0  88  64
영희   2  여자  88  120.0  62  72
민철   1  남자  92   70.0  83  79
수현   3  여자  63   60.0  31  71
호영   4  남자  75   50.0  90  88
영호   4  남자  80   88.0  91  72
용식   2  남자  82   88.0  79  90
나영   1  여자  90   92.0  81  95
석영   1  남자  91   90.0  89  80
정호   2  남자  90   80.0  70  60
민정   4  여자  81   72.0  84  90
형석   2  남자  90   80.0  70  60
석호   2  남자  93    NaN  71  68
철민   1  남자  98   77.0  88  64

In [30]:
k1 = df.drop('철민')
k1

    학년  성별  국어     영어  수학  과학
이름
철수   1  남자  98   77.0  88  64
영희   2  여자  88  120.0  62  72
민철   1  남자  92   70.0  83  79
수현   3  여자  63   60.0  31  71
호영   4  남자  75   50.0  90  88
영호   4  남자  80   88.0  91  72
용식   2  남자  82   88.0  79  90
나영   1  여자  90   92.0  81  95
석영   1  남자  91   90.0  89  80
정호   2  남자  90   80.0  70  60
민정   4  여자  81   72.0  84  90
형석   2  남자  90   80.0  70  60
석호   2  남자  93    NaN  71  68

다중 행 삭제

In [31]:
k2 = df.drop(['석영', '정호', '민정', '형석'])
k2

    학년  성별  국어     영어  수학  과학
이름
철수   1  남자  98   77.0  88  64
영희   2  여자  88  120.0  62  72
민철   1  남자  92   70.0  83  79
수현   3  여자  63   60.0  31  71
호영   4  남자  75   50.0  90  88
영호   4  남자  80   88.0  91  72
용식   2  남자  82   88.0  79  90
나영   1  여자  90   92.0  81  95
석호   2  남자  93    NaN  71  68
철민   1  남자  98   77.0  88  64

index에 대한 인덱싱으로 삭제하기

In [32]:
k3 = df.drop(df.index[0])
k3

    학년  성별  국어     영어  수학  과학
이름
영희   2  여자  88  120.0  62  72
민철   1  남자  92   70.0  83  79
수현   3  여자  63   60.0  31  71
호영   4  남자  75   50.0  90  88
영호   4  남자  80   88.0  91  72
용식   2  남자  82   88.0  79  90
나영   1  여자  90   92.0  81  95
석영   1  남자  91   90.0  89  80
정호   2  남자  90   80.0  70  60
민정   4  여자  81   72.0  84  90
형석   2  남자  90   80.0  70  60
석호   2  남자  93    NaN  71  68
철민   1  남자  98   77.0  88  64

index에 대한 슬라이싱으로 삭제하기

In [33]:
k4 = df.drop(df.index[0:10])
k4

    학년  성별  국어    영어  수학  과학
이름
민정   4  여자  81  72.0  84  90
형석   2  남자  90  80.0  70  60
석호   2  남자  93   NaN  71  68
철민   1  남자  98  77.0  88  64

### 3. 열 추가
- k4 이어서 진행

리스트로 추가

In [34]:
k4['한국사'] = [72, 56, 90, 88]
k4

    학년  성별  국어    영어  수학  과학  한국사
이름
민정   4  여자  81  72.0  84  90   72
형석   2  남자  90  80.0  70  60   56
석호   2  남자  93   NaN  71  68   90
철민   1  남자  98  77.0  88  64   88

딕셔너리로 추가하기

In [35]:
k4['세계사'] = {'민정':90, '형석':88, '석호':72, '철민':56}
k4

    학년  성별  국어    영어  수학  과학  한국사  세계사
이름
민정   4  여자  81  72.0  84  90   72   90
형석   2  남자  90  80.0  70  60   56   88
석호   2  남자  93   NaN  71  68   90   72
철민   1  남자  98  77.0  88  64   88   56

Series 객체로 추가하기
- 각 값이 연결될 행의 이름(index)를 지정
- 부분적으로 값을 비워 둘 수 있다(NaN)

In [36]:
# 순서는 상관 없음(index, value 값만 맞추면 됨)
s = Series([72, 56, 90, 88], index = ['석호', '철민', '민정', '형석'])
k4['윤리'] = s
k4

    학년  성별  국어    영어  수학  과학  한국사  세계사  윤리
이름
민정   4  여자  81  72.0  84  90   72   90  90
형석   2  남자  90  80.0  70  60   56   88  88
석호   2  남자  93   NaN  71  68   90   72  72
철민   1  남자  98  77.0  88  64   88   56  56

단일 값 추가하기

In [37]:
k4['체육'] = 100
k4

    학년  성별  국어    영어  수학  과학  한국사  세계사  윤리   체육
이름
민정   4  여자  81  72.0  84  90   72   90  90  100
형석   2  남자  90  80.0  70  60   56   88  88  100
석호   2  남자  93   NaN  71  68   90   72  72  100
철민   1  남자  98  77.0  88  64   88   56  56  100